app/controllers/api/v2/inventory_releases_controller.rb

  def index
    @inv_releases = InventoryRelease.where("client_id = ? AND department_id = ?", current_user.company.id, current_user.department.id).paginate(:page => params[:page], :per_page => PER_PAGE)
---
SELECT  "inventory_releases".* FROM "inventory_releases"  WHERE (client_id = '1412a2ae-acd4-4b39-aca4-af107110999d' AND department_id = '8eebcb3d-939f-4757-a0c5-cef239576190') LIMIT 30 OFFSET 0
SELECT  "companies".* FROM "companies"  WHERE "companies"."id" = $1 LIMIT 1
SELECT  "departments".* FROM "departments"  WHERE "departments"."id" = $1 LIMIT 1